---
tags:
  - Лекция
Тема: 1.2. Надежность устройств и достоверность информации
Количество часов: 1
Номер занятия: 9
Состояние: Нужно усовершенствовать 
---

# Методы контроля передачи информации. Методы контроля арифметических и логических операций

## Цели и задачи лекции
- Понять роль контроля передачи данных и арифметических/логических операций в компьютерных системах.
- Изучить основные техники контроля целостности: контрольные суммы, CRC, Hamming код, checksums.
- Освоить примеры реализации методов контроля на Python.
- Оценить влияние ошибок и способы их обнаружения и коррекции.

## Ключевые понятия
| Термин | Определение |
|--------|-------------|
| **Контрольная сумма** | Целочисленный итог, вычисляемый из данных, используемый для проверки целостности. |
| **CRC (циклический избыточный код)** | Алгоритм, применяемый к битовым строкам для обнаружения ошибок в передаче. |
| **Hamming код** | Способ кодирования, позволяющий обнаруживать и исправлять одиночные ошибки. |
| **Parity bit** | Бит, добавляемый к данным для проверки четности/нечетности. |
| **Error‑detecting code** | Код, обеспечивающий обнаружение ошибок без их исправления. |
| **Error‑correcting code** | Код, позволяющий обнаружить и восстановить повреждённые данные. |
| **Redundancy** | Добавление избыточных данных для повышения надежности передачи. |
| **Checksum** | Сумма, получаемая по определённому алгоритму, часто используемая в сетевых протоколах. |
| **Modulo‑2 division** | Деление по модулю 2, используемое в CRC‑алгоритмах. |
| **Bit‑wise operations** | Операции над отдельными битами, применяемые в вычислении контрольных значений. |

## Основное содержание

### 1. Контроль передачи данных (5 мин)
- Зачем нужен контроль: обнаружение потерь, искажений, ошибок в канале связи.
- Классификация методов: обнаружение (error‑detecting) vs. коррекция (error‑correcting).

### 2. Контрольные суммы и checksums (10 мин)
- Формула простого контрольного числа: сумма байтов modulo 256.
- Пример на Python: вычисление и проверка checksums для файла.
```python
def checksum(data: bytes) -> int:
    return sum(data) % 256

data = b'Hello, world!'
cs = checksum(data)
print(f'Checksum: {cs}')
```

### 3. CRC: принципы и реализация (15 мин)
- Алгоритм CRC‑32: деление по модулю 2, полином 0x104C11DB7.
- Пошаговое объяснение: добавление нулей, побитовый XOR.
- Реализация в Python без использования `zlib`.
```python
def crc32(data: bytes, poly=0x104C11DB7) -> int:
    crc = 0xFFFFFFFF
    for byte in data:
        crc ^= byte << 24
        for _ in range(8):
            if crc & 0x80000000:
                crc = (crc << 1) ^ poly
            else:
                crc <<= 1
            crc &= 0xFFFFFFFF
    return crc ^ 0xFFFFFFFF

print(f'CRC32: {crc32(b"Hello, world!"):08X}')
```

### 4. Hamming код и коррекция ошибок (10 мин)
- Структура Hamming(7,4): 4 данных + 3 контрольных бита.
- Алгоритм вычисления контрольных битов.
- Пример исправления одиночной ошибки.
```python
def hamming_encode(bits: int) -> int:
    # bits – 4‑битное число
    d = [(bits >> i) & 1 for i in range(4)]
    p1 = d[0] ^ d[1] ^ d[3]
    p2 = d[0] ^ d[2] ^ d[3]
    p4 = d[1] ^ d[2] ^ d[3]
    encoded = (p4 << 6) | (p2 << 5) | (d[2] << 4) | (p1 << 3) | (d[1] << 2) | (d[0] << 1) | 0
    return encoded

def hamming_decode(encoded: int) -> int:
    bits = [(encoded >> i) & 1 for i in range(7)]
    p1, p2, d3, p4, d2, d1, d0 = bits[3], bits[4], bits[6], bits[5], bits[2], bits[1], bits[0]
    s1 = p1 ^ d0 ^ d1 ^ d3
    s2 = p2 ^ d0 ^ d2 ^ d3
    s4 = p4 ^ d1 ^ d2 ^ d3
    error_pos = (s4 << 2) | (s2 << 1) | s1
    if error_pos:
        bits[error_pos - 1] ^= 1  # исправляем бит
    return (bits[6] << 3) | (bits[4] << 2) | (bits[2] << 1) | bits[0]

enc = hamming_encode(0b1011)
print(f'Encoded: {enc:07b}')
print(f'Decoded: {hamming_decode(enc):04b}')
```

### 5. Практическое сравнение методов (5 мин)
- Таблица сравнений: надёжность, сложность, размер избыточных данных.
- Когда применяют CRC, когда Hamming, когда простые checksums.

## Выводы по лекции
- Контроль передачи данных критически важен для надёжности компьютерных систем.
- Простые методы (checksum, parity) подходят для небольших систем и протоколов, где вероятность ошибок низка.
- CRC обеспечивает высокую степень обнаружения ошибок и широко используется в сетевых протоколах.
- Hamming код позволяет не только обнаруживать, но и исправлять одиночные ошибки, но требует большего объёма избыточных битов.
- Практическая реализация в Python позволяет быстро проверить и закрепить понимание алгоритмов.

## Вопросы для самопроверки
1. Что такое контрольная сумма и как она используется в протоколах передачи данных?
2. Как работает алгоритм CRC‑32 и какие преимущества он имеет по сравнению с простыми checksums?
3. В чем отличие между error‑detecting и error‑correcting кодами?
4. Как вычисляются контрольные биты в Hamming(7,4)?
5. Что произойдет, если в коде Hamming(7,4) возникнут две ошибки?
6. Какое влияние оказывает размер избыточных данных на пропускную способность канала?
7. Почему в CRC используется деление по модулю 2?
8. Как проверить, что CRC‑код действительно обнаруживает все одиночные ошибки?
9. Какие реальные протоколы используют CRC‑32?
10. В каких случаях предпочтительнее использовать parity bit вместо CRC?

## Рекомендуемая литература / источники
- К. Р. Косов, *Информатика и вычислительные машины*, 2006.
- D. J. C. W. Hamming, *Error Detecting and Correcting Codes*, 1950.
- J. G. K. C. R. Patterson, *Computer Networking: A Top-Down Approach*, 2011.

