---
tags:
  - Обязательная_контрольная_работа
Тема: 1.2. Надежность устройств и достоверность информации
Количество часов: 1
Номер занятия: 2
Состояние: Нужно усовершенствовать 
---

# Обязательная контрольная работа №1

## Цель и задачи контрольной работы
1. Проверить знания о базовых конструкциях языка Python.  
2. Оценить умение применять условные операторы и циклы.  
3. Оценить навыки работы со строками, списками и функциями.  
4. Развить логическое мышление при решении задач на анализ.

## Краткое теоретическое введение
- **Переменные и типы данных**: int, float, str, bool, list, tuple, dict, set.  
- **Условные операторы**: `if`, `elif`, `else`.  
- **Циклы**: `for`, `while`, `break`, `continue`.  
- **Функции**: определение (`def`), аргументы, возвращаемое значение.  
- **Строковые методы**: `len()`, `str.upper()`, `str.split()`, `str.format()`.  
- **Списковые включения**: `[x for x in iterable if condition]`.  
- **Форматирование вывода**: f-строки (`f'{var:.2f}'`).

## Условия выполнения
- Сдача в виде одного PDF‑файла, включающего решение всех заданий.  
- В коде использовать только стандартную библиотеку Python 3.11+.  
- В комментариях к коду кратко объяснить ключевые шаги.  
- Оформление: шрифт Times New Roman, размер 12, одинарный интервал, заголовки H1–H3.  
- Максимальный балл – 30.  
- Срок сдачи: 7 дней с даты выдачи работы.

## Варианты заданий

### Вариант 1

1. **Теоретический вопрос (5 б)**  
   Объясните разницу между списком и кортежем в Python.  
2. **Практическое задание (10 б)**  
   Напишите программу, которая читает список целых чисел из файла `numbers.txt` (по одному числу в строке) и выводит сумму только чётных чисел.  
3. **Задание на анализ (5 б)**  
   Оцените эффективность алгоритма из пункта 2: как изменится производительность при увеличении размера входных данных?  
4. **Кодовое задание (10 б)**  
   Реализуйте функцию `is_prime(n)` без использования внешних библиотек, которая возвращает `True`, если `n` – простое число, иначе `False`.  
5. **Форматирование (5 б)**  
   Сформируйте вывод результатов в виде таблицы с двумя столбцами: «Число» и «Статус» (Чётное/Нечётное).  

### Вариант 2

1. **Теоретический вопрос (5 б)**  
   Что такое словарь в Python и как он реализован?  
2. **Практическое задание (10 б)**  
   Создайте словарь, где ключами являются имена городов, а значениями – их площади. Добавьте в словарь 5 городов и выведите название города с наибольшей площадью.  
3. **Задание на проектирование (5 б)**  
   Опишите, какие типы данных лучше использовать для хранения информации о пользователе (имя, возраст, список заказов) и почему.  
4. **Кодовое задание (10 б)**  
   Напишите функцию `filter_even_numbers(lst)` возвращающую новый список, состоящий только из чётных чисел входного списка.  
5. **Форматирование (5 б)**  
   Выведите результат функции в виде списка, каждая строка содержит номер элемента и его значение.  

### Вариант 3

1. **Теоретический вопрос (5 б)**  
   Как работает оператор `break` в цикле?  
2. **Практическое задание (10 б)**  
   Реализуйте программу, которая запрашивает у пользователя целое число `n` и выводит таблицу умножения от 1 до `n`.  
3. **Задание на анализ (5 б)**  
   Опишите, какие ошибки могут возникнуть при вводе некорректных данных и как их обработать.  
4. **Кодовое задание (10 б)**  
   Напишите функцию `find_max_min(lst)` без использования встроенных `max`/`min`, возвращающую кортеж `(максимум, минимум)`.  
5. **Форматирование (5 б)**  
   Отформатируйте вывод так, чтобы каждая строка таблицы умножения была выровнена по правому краю.  

## Критерии оценивания
- **Теоретические вопросы** – 5 б каждый.  
- **Практические задания** – 10 б каждый.  
- **Аналитические/проектные задания** – 5 б.  
- **Форматирование вывода** – 5 б.  
- **Код**: корректность (5 б), читаемость (3 б), комментарии (2 б).

## Рекомендации для студента
1. Перечитайте разделы «Условные операторы» и «Циклы» в учебнике.  
2. Практикуйтесь писать функции, обращая внимание на аргументы и возвращаемые значения.  
3. Тестируйте свой код с разными входными данными, включая граничные случаи.  
4. Форматируйте вывод аккуратно, соблюдая требования к таблицам и спискам.  

## Пример решения (вариант 1, задание 2)

```python
# Задача: вывести сумму чётных чисел из файла numbers.txt

def sum_even_numbers(file_path: str) -> int:
    """Возвращает сумму чётных чисел из указанного файла."""
    total = 0
    with open(file_path, 'r', encoding='utf-8') as f:
        for line in f:
            try:
                num = int(line.strip())
            except ValueError:
                # пропускаем некорректные строки
                continue
            if num % 2 == 0:
                total += num
    return total

# Пример использования
if __name__ == "__main__":
    result = sum_even_numbers('numbers.txt')
    print(f"Сумма чётных чисел: {result}")
```

*Пояснение*:  
- Функция открывает файл и читает построчно.  
- Каждая строка преобразуется в `int`; при ошибке пропускается.  
- Если число чётное (`num % 2 == 0`), оно добавляется к сумме.  
- После завершения чтения возвращается итоговая сумма.  

## Время на выполнение
1 час

## Выводы
Контрольная работа проверяет базовые навыки работы с Python: понимание типов данных, использование условных операторов и циклов, работа со строками и списками, а также умение писать чистый, читаемый код с комментариями. Успешное выполнение демонстрирует готовность студента к дальнейшему изучению более сложных тем.

